[
    ["DENI", "Lower Saxony", "Lower Saxony (German: Niedersachsen [ˈniːdɐzaksn̩] (About this soundlisten); Low German: Neddersassen; Saterland Frisian: Läichsaksen) is a German state (Land) situated in northwestern Germany. It is the second-largest state by land area, with 47,624 km2 (18,388 sq mi), and fourth-largest in population (7.9 million) among the 16 Länder federated as the Federal Republic of Germany. In rural areas, Northern Low Saxon (a dialect of Low German) and Saterland Frisian (a variety of the Frisian language) are still spoken, but the number of speakers is declining.<br><br>Lower Saxony borders on (from north and clockwise) the North Sea, the states of Schleswig-Holstein, Hamburg, Mecklenburg-Vorpommern, Brandenburg, Saxony-Anhalt, Thuringia, Hesse and North Rhine-Westphalia, and the Netherlands (Drenthe, Groningen and Overijssel). Furthermore, the state of Bremen forms two enclaves within Lower Saxony, one being the city of Bremen, the other, its seaport city of Bremerhaven (which is a semi-enclave, as it has a coastline). In fact, Lower Saxony borders more neighbours than any other single Bundesland. The state's principal cities include the state capital Hanover, Braunschweig (Brunswick), Lüneburg, Osnabrück, Oldenburg, Hildesheim, Wolfenbüttel, Wolfsburg, and Göttingen.<br><br>The northwestern area of Lower Saxony, which lies on the coast of the North Sea, is called East Frisia and the seven East Frisian Islands offshore are popular with tourists. In the extreme west of Lower Saxony is the Emsland, an economically emerging but rather sparsely populated area, once dominated by inaccessible swamps. The northern half of Lower Saxony, also known as the North German Plains, is almost invariably flat except for the gentle hills around the Bremen geestland. Towards the south and southwest lie the northern parts of the German Central Uplands: the Weser Uplands and the Harz mountains. Between these two lie the Lower Saxon Hills, a range of low ridges. Thus, Lower Saxony is the only Bundesland that encompasses both maritime and mountainous areas.<br><br>Lower Saxony's major cities and economic centres are mainly situated in its central and southern parts, namely Hanover, Braunschweig, Osnabrück, Wolfsburg, Salzgitter, Hildesheim, and Göttingen. Oldenburg, near the northwestern coastline, is another economic centre. The region in the northeast is called the Lüneburg Heath (Lüneburger Heide), the largest heathland area of Germany and in medieval times wealthy due to salt mining and salt trade, as well as to a lesser degree the exploitation of its peat bogs until about the 1960s. To the north, the Elbe River separates Lower Saxony from Hamburg, Schleswig-Holstein, Mecklenburg-Vorpommern, and Brandenburg. The banks just south of the Elbe are known as Altes Land (Old Country). Due to its gentle local climate and fertile soil, it is the state's largest area of fruit farming, its chief produce being apples.<br><br>Most of the state's territory was part of the historic Kingdom of Hanover; the state of Lower Saxony has adopted the coat of arms and other symbols of the former kingdom. It was created by the merger of the State of Hanover with three smaller states on 1 November 1946.", "deni.png", "Hanover"],
    ["DEBB", "Brandenburg", "Brandenburg (/ˈbrændənbɜːrɡ/, also US: /ˈbrɑːndənbʊərk/,[5][6][7] German: [ˈbʁandn̩bʊʁk] (About this soundlisten); Low German: Brannenborg; Lower Sorbian: Bramborska) is a state in the northeast of Germany. With an area of 29,478 square kilometres (11,382 sq mi) and a population of 2.5 million residents, it is the fifth-largest German state by area and the tenth-most populous. Potsdam is the state capital and largest city, while other major towns include Cottbus, Brandenburg an der Havel and Frankfurt (Oder).<br><br>Brandenburg surrounds the national capital and city-state of Berlin, and together they form the Berlin/Brandenburg Metropolitan Region, the third-largest metropolitan area in Germany.<br><br>Brandenburg borders the states of Mecklenburg-Vorpommern, Lower Saxony, Saxony-Anhalt, and Saxony, as well as the country of Poland.<br><br>Brandenburg originated in the Northern March in the 900s AD, from areas conquered from the Wends. It later became the Margraviate of Brandenburg, a major principality of the Holy Roman Empire. In the 15th century, it came under the rule of the House of Hohenzollern, which later also became the ruling house of the Duchy of Prussia and established Brandenburg-Prussia, the core of the later Kingdom of Prussia. From 1815 to 1947, Brandenburg was a province of Prussia.<br><br>Following the abolition of Prussia after World War II, Brandenburg was established as a state by the Soviet Military Administration in Germany, and became a state of the German Democratic Republic in 1949. In 1952, the state was dissolved and broken up into multiple regional districts. Following German reunification, Brandenburg was re-established in 1990 and became one of the five new states of the Federal Republic of Germany.", "debb.png", "Potsdam"],
    ["DEBE", "Berlin", "Berlin (/bɜːrˈlɪn/; German: [bɛʁˈliːn] (About this soundlisten))[7] is the capital and largest city of Germany by both area and population.[8][9] Its 3.8 million inhabitants make it the European Union's most populous city, according to population within city limits.[2] One of Germany's sixteen constituent states, Berlin is surrounded by the State of Brandenburg and contiguous with Potsdam, Brandenburg's capital. Berlin's urban area, which has a population of around 4.5 million, is the second most populous urban area in Germany after the Ruhr.[3] The Berlin-Brandenburg capital region has over six million inhabitants and is Germany's third-largest metropolitan region after the Rhine-Ruhr and Rhine-Main regions.[10]<br><br>Berlin straddles the banks of the Spree, which flows into the Havel (a tributary of the Elbe) in the western borough of Spandau. Among the city's main topographical features are the many lakes in the western and southeastern boroughs formed by the Spree, Havel and Dahme, the largest of which is Lake Müggelsee. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. About one-third of the city's area is composed of forests, parks, gardens, rivers, canals and lakes.[11] The city lies in the Central German dialect area, the Berlin dialect being a variant of the Lusatian-New Marchian dialects.<br><br>First documented in the 13th century and at the crossing of two important historic trade routes,[12] Berlin became the capital of the Margraviate of Brandenburg (1417–1701), the Kingdom of Prussia (1701–1918), the German Empire (1871–1918), the Weimar Republic (1919–1933), and the Third Reich (1933–1945). Berlin in the 1920s was the third-largest municipality in the world.[13] After World War II and its subsequent occupation by the victorious countries, the city was divided; West Berlin became a de facto exclave of West Germany, surrounded by the Berlin Wall (1961–1989) and East German territory.[14] East Berlin was declared capital of East Germany, while Bonn became the West German capital. Following German reunification in 1990, Berlin once again became the capital of all of Germany.<br><br>Berlin is a world city of culture, politics, media and science.[15][16][17][18] Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues.[19][20] Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination.[21] Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics.<br><br>Berlin is home to world-renowned universities such as the Humboldt Universität zu Berlin (HU Berlin), the Technische Universität Berlin (TU Berlin), the Freie Universität Berlin (Free University of Berlin), the Universität der Künste (University of the Arts, UdK) ESMT Berlin and Bard College Berlin. Its Zoological Garden is the most visited zoo in Europe and one of the most popular worldwide. With the world's oldest large-scale movie studio complex, Berlin is an increasingly popular location for international film productions.[22] The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a very high quality of living.[23] Since the 2000s Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.[24]<br><br>Berlin contains three World Heritage Sites: Museum Island; the Palaces and Parks of Potsdam and Berlin; and the Berlin Modernism Housing Estates.[25] Other landmarks include the Brandenburg Gate, the Reichstag building, Potsdamer Platz, the Memorial to the Murdered Jews of Europe, the Berlin Wall Memorial, the East Side Gallery, the Berlin Victory Column, Berlin Cathedral and the Berlin Television Tower, the tallest structure in Germany. Berlin has numerous museums, galleries, libraries, orchestras, and sporting events. These include the Old National Gallery, the Bode Museum, the Pergamon Museum, the German Historical Museum, the Jewish Museum Berlin, the Natural History Museum, the Humboldt Forum, the Berlin State Library, the Berlin State Opera, the Berlin Philharmonic and the Berlin Marathon.", "debe.png", "Berlin"],
    ["DEBW", "Baden-Württemberg", "Baden-Württemberg (/ˌbɑːdən ˈvɜːrtəmbɜːrɡ/;[5] German: [ˌbaːdn̩ ˈvʏʁtəmbɛʁk] (About this soundlisten)) is a German state (Land) in Southwest Germany, east of the Rhine, which forms the southern part of Germany's western border with France. With more than 11 million inhabitants as of 2017 across a total area of nearly 35,752 km2 (13,804 sq mi), it is the third-largest German state by both area (behind Bavaria and Lower Saxony) and population (behind North Rhine-Westphalia and Bavaria).[6] As a federated state, Baden-Württemberg is a partly-sovereign parliamentary republic. The largest city in Baden-Württemberg is the state capital of Stuttgart, followed by Mannheim and Karlsruhe. Other major cities are Freiburg im Breisgau, Heidelberg, Heilbronn, Pforzheim, Reutlingen, Tübingen, and Ulm.<br><br>What is now Baden-Württemberg was formerly the historical territories of Baden, Prussian Hohenzollern, and Württemberg. Baden-Württemberg became a state of West Germany in April 1952 by the merger of Württemberg-Baden, South Baden, and Württemberg-Hohenzollern. These states had just been artificially created by the Allies after World War II out of the existing traditional states Baden and Württemberg by their separation over different occupation zones.<br><br>Baden-Württemberg is especially known for its strong economy with various industries like car manufacturing, electrical engineering, mechanical engineering, the service sector, and more.[7][8][9] It has the third highest gross regional product (GRP) in Germany. Part of the Four Motors for Europe, some of the largest German companies are headquartered in Baden-Württemberg, including Daimler, Porsche, Bosch and SAP.<br><br>The sobriquet Ländle (a diminutive of the word \"Land\" in the local Alemannic and Franconian dialects) is sometimes used as a synonym for Baden-Württemberg.", "debw.png", "Stuttgart"],
    ["DEBY", "Bavaria", "Bavaria (/bəˈvɛəriə/; German and Bavarian: Bayern German pronunciation: [ˈbaɪɐn]), officially the Free State of Bavaria (German and Bavarian: Freistaat Bayern; German: [ˈfʁaɪʃtaːt ˈbaɪɐn] (About this soundlisten)), is a landlocked state (Land) in the south-east of Germany. With an area of 70,550.19 square kilometres (27,239.58 sq mi), Bavaria is the largest German state by land area, comprising roughly a fifth of the total land area of Germany. With over 13 million inhabitants, it is second in population only to North Rhine-Westphalia, but due to its large size it is one of the least densely populated states. Bavaria's main cities are Munich (its capital and largest city and also the third largest city in Germany),[4] Nuremberg, and Augsburg.<br><br>The history of Bavaria includes its earliest settlement by Iron Age Celtic tribes, followed by the conquests of the Roman Empire in the 1st century BC, when the territory was incorporated into the provinces of Raetia and Noricum. It became a stem duchy in the 6th century AD following the collapse of the Western Roman Empire. It was later incorporated into the Holy Roman Empire, became an independent kingdom after 1806, joined the Prussian-led German Empire in 1871 while retaining its title of kingdom, and finally became a state of the Federal Republic of Germany in 1949.[5]<br><br>Bavaria has a unique culture, largely because of the state's large Catholic plurality and conservative traditions.[6] Bavarians have traditionally been proud of their culture, which includes a language, cuisine, architecture, festivals such as Oktoberfest and elements of Alpine symbolism.[7] The state also has the second largest economy among the German states by GDP figures, giving it a status as a rather wealthy German region.[8]<br><br>Contemporary Bavaria also includes parts of the historical regions of Franconia and Swabia.", "deby.png", "Munich"],
    ["DEHB", "Free Hanseatic City of Bremen", "Bremen (German: [ˈbʁeːmən] (About this soundlisten)), officially the Free Hanseatic City of Bremen (German: Freie Hansestadt Bremen), is the smallest and least populous of Germany's 16 states. It is informally called Land Bremen (\"State of Bremen\"), although this is sometimes used in official contexts. The state consists of the city of Bremen and its seaport exclave, Bremerhaven, surrounded by the larger state of Lower Saxony in northern Germany.<br><br>The state of Bremen consists of two non-contiguous territories. These enclaves contain Bremen, officially the 'City' (Stadtgemeinde Bremen) which is the state capital, and the city of Bremerhaven (Stadt Bremerhaven). Both are located on the River Weser; Bremerhaven (i\"Bremen's harbour\") is further downstream on the mouth of the Weser with open access to the North Sea. Both enclaves are completely surrounded by the neighbouring State of Lower Saxony (Niedersachsen). The highest point in the state is in Friedehorst Park (32.5m).", "dehb.png","Bremen"],
    ["DEHE", "Hesse", "Hesse (/hɛs/,[4] US also /ˈhɛsə, ˈhɛsi/,[5] Hessian dialect: [ˈhɛzə]) or Hessia (UK: /ˈhɛsiə/, US: /ˈhɛʃə/; German: Hessen [ˈhɛsn̩] (About this soundlisten)), officially the State of Hessen (German: Land Hessen), is a state of the Federal Republic of Germany. Its capital city is Wiesbaden, and the largest urban area is Frankfurt. With an area of 21,000 square kilometers and a population of just over six million it ranks seventh and fifth respectively among the sixteen German states. Frankfurt Rhine-Main, Germany's second-largest metropolitan area (after Rhine-Ruhr), is mainly located in Hesse.<br><br>As a cultural region, Hessen also includes the area known as Rhenish Hesse (Rheinhessen) in the neighbouring state of Rhineland-Palatinate.", "dehe.png", "Wiesbaden"],
    ["DEHH", "Hamburg", "Hamburg (English: /ˈhæmbɜːrɡ/; German: [ˈhambʊʁk] (About this soundlisten), locally also [ˈhambʊɪ̯ç] (About this soundlisten); Low Saxon: Hamborg [ˈhambɔːç] (About this soundlisten)), officially the Free and Hanseatic City of Hamburg (German: Freie und Hansestadt Hamburg; Low Saxon: Friee un Hansestadt Hamborg),[6] is the second-largest city in Germany after Berlin and 7th largest city in the European Union with a population of over 1.84 million.[7] Hamburg's urban area has a population of around 2.5 million[1] and its metropolitan area is home to more than five million people. The city lies on the River Elbe and two of its tributaries, the River Alster and the River Bille. One of Germany's 16 federated states, Hamburg is surrounded by Schleswig-Holstein to the north and Lower Saxony to the south.<br><br>The official name reflects Hamburg's history as a member of the medieval Hanseatic League and a free imperial city of the Holy Roman Empire. Before the 1871 Unification of Germany, it was a fully sovereign city state, and before 1919 formed a civic republic headed constitutionally by a class of hereditary grand burghers or Hanseaten. Beset by disasters such as the Great Fire of Hamburg, North Sea flood of 1962 and military conflicts including World War II bombing raids, the city has managed to recover and emerge wealthier after each catastrophe.<br><br>Hamburg is Europe's third largest port, after Rotterdam and Antwerp. Major regional broadcaster NDR, the printing and publishing firm Gruner + Jahr and the newspapers Der Spiegel and Die Zeit are based in the city. Hamburg is the seat of Germany's oldest stock exchange and the world's oldest merchant bank, Berenberg Bank. Media, commercial, logistical, and industrial firms with significant locations in the city include multinationals Airbus, Blohm + Voss, Aurubis, Beiersdorf, and Unilever. Hamburg is also a major European science, research, and education hub, with several universities and institutions. The city enjoys a very high quality of living, being ranked 19th in the 2019 Mercer Quality of Living Survey.[8]<br><br>Hamburg hosts specialists in world economics and international law, including consular and diplomatic missions as the International Tribunal for the Law of the Sea, the EU-LAC Foundation, and the UNESCO Institute for Lifelong Learning, multipartite international political conferences and summits such as Europe and China and the G20. Both former German Chancellor Helmut Schmidt and Angela Merkel, German chancellor since 2005, were born in Hamburg.<br><br>Hamburg is a major international and domestic tourist destination. The Speicherstadt and Kontorhausviertel were declared World Heritage Sites by UNESCO in 2015.[9] Hamburg's rivers and canals are crossed by around 2,500 bridges, making it the city with the highest number of bridges in Europe.[10] Aside from its rich architectural heritage, the city is also home to notable cultural venues such as the Elbphilharmonie and Laeiszhalle concert halls. It gave birth to movements like Hamburger Schule and paved the way for bands including The Beatles. Hamburg is also known for several theatres and a variety of musical shows. St. Pauli's Reeperbahn is among the best-known European entertainment districts.", "dehh.png", "Hamburg"],
    ["DEMV", "Mecklenburg-Vorpommern", "Mecklenburg-Vorpommern (MV; German: [ˈmeːklənbʊʁk ˈfoːɐ̯pɔmɐn], Mecklenburgian Low German: Mäkelborg-Vörpommern), also known by its anglicized name Mecklenburg-Western Pomerania or Mecklenburg-West Pomerania, is a state in the north-east of Germany. Of the country's sixteen states, Mecklenburg-Vorpommern ranks 14th in population, 6th in area, and 16th in population density. Schwerin is the state capital and Rostock is the largest city. Other major cities include Neubrandenburg, Stralsund, Greifswald, Wismar and Güstrow.<br<br>The state was established in 1945 after World War II through the merger of the historic regions of Mecklenburg and the Prussian Western Pomerania by the Soviet military administration in Allied-occupied Germany. It became part of the German Democratic Republic in 1949, but was dissolved in 1952 during administrative reforms and its territory divided into the districts of Rostock, Schwerin, and Neubrandenburg. A state called in German Mecklenburg-Vorpommern was re-established in 1990 following German reunification, and became one of the new states of the Federal Republic of Germany.<br><br>On the state's coastline on the Baltic Sea are many holiday resorts and much unspoilt nature, including the islands of Rügen, Usedom, and others, as well as the Mecklenburg Lake District, making the state one of Germany's leading tourist destinations. Three of Germany's fourteen national parks, as well as several hundred nature conservation areas, are in the state. The University of Rostock, founded in 1419, and the University of Greifswald, established in 1456, are among the oldest universities in Europe. In 2007, the 33rd G8 summit took place at the Grand Hotel Heiligendamm on the Mecklenburg Baltic coast.", "demv.png", "Schwerin"],
    ["DENW", "North Rhine-Westphalia", "North Rhine-Westphalia (German: Nordrhein-Westfalen, pronounced [ˌnɔʁtʁaɪn vɛstˈfaːlən] (About this soundlisten); Low Franconian: Noordrien-Wesfale; Low German: Noordrhien-Westfalen; Kölsch: Noodrhing-Wäßßfaale), commonly shortened to NRW (German: [ɛnʔɛʁˈveː] (About this soundlisten)) in both written and spoken language, is a German state (Land) in Western Germany. With more than 17.9 million inhabitants, it is the most populous state of Germany. Covering an area of 34,084 square kilometres (13,160 sq mi), it is the fourth-largest German state by size. Apart from the city-states, it is also the most densely populated state in Germany.<br><br>North Rhine-Westphalia features 30 of the 81 German municipalities with over 100,000 inhabitants, including Cologne (over 1 million), the state capital Düsseldorf, Dortmund and Essen (all about 600,000 inhabitants) and other cities predominantly located in the Rhine-Ruhr metropolitan area, the largest urban area in Germany and the third-largest on the European continent. The location of the Rhine-Ruhr at the heart of the European Blue Banana makes it well connected to other major European cities and metropolitan areas like the Randstad, the Flemish Diamond and the Frankfurt Rhine-Main Region.<br><br>North Rhine-Westphalia was established in 1946 after World War II from the Prussian provinces of Westphalia and the northern part of Rhine Province (North Rhine), and the Free State of Lippe by the British military administration in Allied-occupied Germany and became a state of the Federal Republic of Germany in 1949. The city of Bonn served as the federal capital until the reunification of Germany in 1990 and as the seat of government until 1999.<br><br>Culturally, North Rhine-Westphalia is not a uniform area; there are significant differences, especially in traditional customs, between the Rhineland region on the one hand and the regions of Westphalia and Lippe on the other. The state has always been Germany's powerhouse with the largest economy among the German states by GDP figures.", "denw.png", "Cologne"],
    ["DERP", "Rhineland-Palatinate", "Rhineland-Palatinate (German: Rheinland-Pfalz, German pronunciation: [ˈʁaɪ̯nlant ˈp͡falt͡s] (About this soundlisten)) is a western state of Germany. It covers 19,846 km2 (7,663 sq mi) and has about 4.05 million residents. It is the ninth largest and sixth most populous of the sixteen states. Mainz is the capital and largest city. Other cities are Ludwigshafen am Rhein, Koblenz, Trier, Kaiserslautern and Worms.[3] It is bordered by North Rhine-Westphalia, Saarland, Baden-Württemberg and Hesse and by the countries France, Luxembourg and Belgium.<br><br>Rhineland-Palatinate was established in 1946 after World War II, from parts of the former states of Prussia (part of its Rhineland province), Hesse and Bavaria (its former outlying Palatinate kreis or district), by the French military administration in Allied-occupied Germany. Rhineland-Palatinate became part of the Federal Republic of Germany in 1949 and shared the country's only border with the Saar Protectorate until the latter was returned to German control in 1957. Rhineland-Palatinate's natural and cultural heritage includes the extensive Palatinate winegrowing region, picturesque landscapes, and many castles and palaces.", "derp.png", "Mainz"],
    ["DESH", "Schleswig-Holstein", "Schleswig-Holstein (German: [ˈʃleːsvɪç ˈhɔlʃtaɪn]) is the northernmost of the 16 states of Germany, comprising most of the historical duchy of Holstein and the southern part of the former Duchy of Schleswig. Its capital city is Kiel; other notable cities are Lübeck and Flensburg.<br><br>The region is called Slesvig-Holsten in Danish and pronounced [ˌsle̝ːsvi ˈhʌlˌste̝ˀn]. In more dated English, it is also known as Sleswick-Holsatia. The Low German name is Sleswig-Holsteen, and the North Frisian name is Slaswik-Holstiinj. Historically, the name can also refer to a larger region, containing both present-day Schleswig-Holstein and the former South Jutland County (Northern Schleswig; now part of the Region of Southern Denmark) in Denmark.<br><br>Schleswig was under Danish control beginning in the Viking Age, but escaped full control and became a duchy in the 12th century. It bordered Holstein, which was nominally a part of the Holy Roman Empire. From 1460, both Schleswig and Holstein were ruled together by a common Duke. In the 19th century it became the subject of an intractable political and territorial dispute: the Schleswig-Holstein Question. The \"question\" came to a head as Denmark tried to formally annex the area in 1848. Prussia, the leading German state before unification, balked at the attempt; it had some claim to the territory and the population was majority ethnic German. It invaded and began the First Schleswig War, which ended in a Danish victory and the 1852 London Protocol. This did not solve the issue for good: fighting broke out again in 1864 with the Second Schleswig War. The second war saw a German victory, with the territory being absorbed into Prussia. After the German defeat in World War I, the 1920 Schleswig plebiscites were held at the command of the Allies which resulted in the return of some territory to Denmark. After World War II, it took in over a million refugees.<br><br>Schleswig-Holstein's economy is known for its agriculture, such as its Holstein cows. Its position on the Atlantic makes it a major trade point and shipbuilding site; it is also the location of the Kiel Canal. Offshore oil wells and wind farms produce significant amounts of energy. Fishing is a major industry and accounts for a unique local cuisine. It is a favorite tourist spot for Germans.", "desh.png", "Kiel"],
    ["DESL", "Saarland", "Saarland (/ˈsɑːrlænd/, also US: /ˈzɑːr-/, German: [ˈzaːɐ̯lant] (About this soundlisten); French: Sarre [saʁ]) is a state of Germany in the west of the country. With an area of 2,570 km2 (990 sq mi) and population of 995,600 in 2015, it is the smallest German state in both area and population apart from the city-states of Berlin, Bremen, and Hamburg.[3] Saarbrücken is the state capital and largest city; other cities include Neunkirchen and Saarlouis. Saarland is mainly surrounded by the department of Moselle (Grand Est) in France to the west and south and the neighboring state of Rhineland-Palatinate in Germany to the north and east; it also shares a small border about 8 kilometres (5 miles) long with the canton of Remich in Luxembourg to the northwest.<br><br>Saarland was established in 1920 after World War I as the Territory of the Saar Basin, occupied and governed by France under a League of Nations mandate. The heavily industrialized region was economically valuable, due to the wealth of its coal deposits and location on the border between France and Germany. Saarland was returned to Nazi Germany in the 1935 Saar status referendum. Following World War II, the French military administration in Allied-occupied Germany organized the territory as the Saar Protectorate on 16 February 1946. After the 1955 Saar Statute referendum, it joined the Federal Republic of Germany as a state on 1 January 1957. Saarland used its own currency, the Saar franc, and postage stamps issued specially for the territory until 1959.", "desl.png", "Saarbrücken"],
    ["DESN", "Free State of Saxony", "Saxony (German: Sachsen [ˌzaksn̩] (About this soundlisten); Upper Sorbian: Sakska), officially the Free State of Saxony (German: Freistaat Sachsen [ˈfʁaɪ̯ʃtaːt ˈzaksn̩], Upper Sorbian: Swobodny stat Sakska), is a landlocked state of Germany, bordering the states of Brandenburg, Saxony-Anhalt, Thuringia, Bavaria, as well as the countries of Poland and the Czech Republic. Its capital is Dresden, and its largest city is Leipzig. Saxony is the tenth largest of Germany's sixteen states, with an area of 18,413 square kilometres (7,109 sq mi), and the sixth most populous, with more than 4 million inhabitants.<br><br>The history of Saxony spans more than a millennium. It has been a medieval duchy, an electorate of the Holy Roman Empire, a kingdom, and twice a republic. The first Free State of Saxony was established in 1918 as a constituent state of the Weimar Republic. After World War II, it became part of the German Democratic Republic and was abolished by the communist government in 1952. Following German reunification, the Free State of Saxony was reconstituted with slightly altered borders in 1990 and became one of the five new states of the Federal Republic of Germany.<br><br>The area of the modern state of Saxony should not be confused with Old Saxony, the area inhabited by Saxons. Old Saxony corresponds roughly to the modern German states of Lower Saxony, Saxony-Anhalt, and the Westphalian part of North Rhine-Westphalia.", "desn.png", "Dresden"],
    ["DEST", "Saxony-Anhalt", "Saxony-Anhalt (German: Sachsen-Anhalt (German pronunciation: [ˌzaksn̩ ˈʔanhalt] (About this soundlisten); Low German: Sassen-Anholt)) is a state of Germany, bordering the states of Brandenburg, Saxony, Thuringia and Lower Saxony. It covers an area of 20,447.7 square kilometres (7,894.9 sq mi)[3] and has a population of 2.19 million inhabitants,[4] making it the 8th-largest state in Germany by area and the 11th-largest by population. Its capital is Magdeburg and its largest city is Halle (Saale).<br><br>The state of Saxony-Anhalt originated in July 1945 after World War II, when the Soviet army administration in Allied-occupied Germany formed it from the former Prussian Province of Saxony and the Free State of Anhalt. Saxony-Anhalt became part of the German Democratic Republic in 1949, but was dissolved in 1952 during administrative reforms and its territory divided into the districts of Halle and Magdeburg, with the city of Torgau joining the district of Leipzig. Following German reunification the state of Saxony-Anhalt was re-established in 1990 and became one of the new states of the Federal Republic of Germany.<br><br>Saxony-Anhalt is renowned for its rich cultural heritage and possesses the highest concentration of UNESCO World Heritage sites in Germany.", "dest.png", "Mafdeburg"],
    ["DETH", "Free State of Thuringia", "Thuringia (English: /θəˈrɪndʒiə/; German: Thüringen [ˈtyːʁɪŋən] (About this soundlisten)), officially the Free State of Thuringia (Freistaat Thüringen [ˈfʁaɪʃtaːt ˈtyːʁɪŋən]), is a state of Germany. Located in central Germany, it covers 16,171 square kilometres (6,244 sq mi), being the sixth smallest of the sixteen German States (including City States). It has a population of about 2.15 million.<br><br>Erfurt is the state capital and largest city. Other cities are Jena, Gera and Weimar. Thuringia is bordered by Bavaria, Hesse, Lower Saxony, Saxony-Anhalt, and Saxony.<br><br>It has been known as \"the green heart of Germany\" (das grüne Herz Deutschlands) from the late 19th century due to its broad, dense forest.[4] Most of Thuringia is in the Saale drainage basin, a left-bank tributary of the Elbe.<br><br>Thuringia is home to the Rennsteig, Germany's best-known hiking trail. Its winter resort of Oberhof makes it a well-equipped winter sports destination – half of Germany's 136 Winter Olympic gold medals as of 2014 were by Thuringian athletes.[5] Thuringia was favoured or was the birthplace of three key intellectuals and leaders in the arts: Johann Sebastian Bach, Johann Wolfgang von Goethe, and Friedrich Schiller.<br><br>The state has the University of Jena, the Ilmenau University of Technology, the University of Erfurt, and the Bauhaus University of Weimar.<br><br>Thuringia had an earlier existence as the Frankish Duchy of Thuringia, established around 631 AD by King Dagobert I. The state was established in 1920 as a state of the Weimar Republic from a merger of the Ernestine duchies, save for Saxe-Coburg. After World War II, Thuringia came under the Soviet occupation zone in Allied-occupied Germany, and its borders were reformed, to become contiguous. Thuringia became part of the German Democratic Republic in 1949, but was dissolved in 1952 during administrative reforms, to be divided into the Districts of Erfurt, Suhl and Gera. Thuringia was re-established in 1990 following German reunification, slightly re-drawn, and became one of the new states of the Federal Republic of Germany.", "deth.png", "Erfurt"],
    ["SW", "Switzerland", "Switzerland, officially the Swiss Confederation, is a landlocked country situated at the confluence of Western, Central, and Southern Europe.[note 4][14] It is a federal republic composed of 26 cantons, with federal authorities based in Bern.[note 1][2][1] Switzerland is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. It is geographically divided among the Swiss Plateau, the Alps, and the Jura, spanning a total area of 41,285 km2 (15,940 sq mi), and land area of 39,997 km2 (15,443 sq mi). Although the Alps occupy the greater part of the territory, the Swiss population of approximately 8.5 million is concentrated mostly on the plateau, where the largest cities and economic centres are located, among them Zürich, Geneva, and Basel. These cities are home to several offices of international organisations such as the headquarters of FIFA, the UN's second-largest Office, and the main building of the Bank for International Settlements. The main international airports of Switzerland are also located in these cities.<br><br>The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The Federal Charter of 1291 is considered the founding document of Switzerland which is celebrated on Swiss National Day. Since the Reformation of the 16th century, Switzerland has maintained a strong policy of armed neutrality; it has not fought an international war since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world.[15] Switzerland is the birthplace of the Red Cross, one of the world's oldest and best known humanitarian organisations, and is home to numerous international organisations, including the United Nations Office at Geneva, which is its second-largest in the world. It is a founding member of the European Free Trade Association, but notably not part of the European Union, the European Economic Area or the Eurozone. However, it participates in the Schengen Area and the European Single Market through bilateral treaties.<br><br>Switzerland occupies the crossroads of Germanic and Romance Europe, as reflected in its four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German-speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy,[16] and Alpine symbolism.[17][18] Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] (German);[note 5] Suisse [sɥis(ə)] (French); Svizzera [ˈzvittsera] (Italian); and Svizra [ˈʒviːtsrɐ, ˈʒviːtsʁɐ] (Romansh).[note 6] On coins and stamps, the Latin name, Confoederatio Helvetica – frequently shortened to \"Helvetia\" – is used instead of the four national languages.<br><br>A developed country, it has the highest nominal wealth per adult[19] and the eighth-highest per capita gross domestic product, and has been considered a tax haven.[20][21] It ranks highly on some international metrics, including economic competitiveness and human development. Its cities such as Zürich, Geneva, and Basel rank among the highest in the world in terms of quality of life,[22][23] albeit with some of the highest costs of living in the world.[24] In 2020, IMD placed Switzerland first in attracting skilled workers.[25] The World Economic Forum ranks it the 5th most competitive country globally.", "switz.png", "Bern"],
    ["PL", "Poland", "Poland,[c] officially the Republic of Poland,[d] is a country located in Central Europe.[14] It is divided into 16 administrative provinces, covering an area of 312,696 square kilometres (120,733 sq mi), and has a largely temperate seasonal climate.[8] With a population of nearly 38.5 million people, Poland is the fifth most populous member state of the European Union.[8] Poland's capital and largest metropolis is Warsaw. Other major cities include Kraków, Łódź, Wrocław, Poznań, Gdańsk, and Szczecin.<br><br>Poland's topographically diverse territory extends from the beaches along the Baltic Sea in the north to the Sudetes and Carpathian Mountains in its south. The country is bordered by Lithuania and Kaliningrad Oblast of Russia to the northeast, Belarus and Ukraine to the east, Slovakia and the Czech Republic to the south, and Germany to the west.[15]<br><br>The history of human activity on Polish soil spans thousands of years. Throughout the late antiquity period it became extensively diverse, with various cultures and tribes settling on the vast Central European Plain. However, it was the Western Polans who dominated the region and gave Poland its name. The establishment of Polish statehood can be traced to 966, when the pagan ruler of a realm coextensive with the territory of present-day Poland embraced Christianity and converted to Catholicism.[16] The Kingdom of Poland was founded in 1025, and in 1569 it cemented its longstanding political association with Lithuania by signing the Union of Lublin. This union formed the Polish–Lithuanian Commonwealth, one of the largest (over 1,000,000 square kilometres – 400,000 square miles) and most populous nations of 16th and 17th century Europe, with a uniquely liberal political system which adopted Europe's first modern constitution, the Constitution of 3 May 1791.[17][18][19]<br><br>With the passing of prominence and prosperity, the country was partitioned by neighbouring states at the end of the 18th century, and regained independence in 1918 with the Treaty of Versailles. After a series of territorial conflicts, the new multi-ethnic Poland restored its position as a key player in European politics. In September 1939, World War II began with the invasion of Poland by Germany, followed by the Soviets invading Poland in accordance with the Molotov–Ribbentrop Pact. Approximately six million Polish citizens, including three million of the country's Jews, perished during the course of the war.[20][21] As a member of the Eastern Bloc, the Polish People's Republic proclaimed forthwith was a chief signatory of the Warsaw Treaty amidst global Cold War tensions. In the wake of the 1989 events, notably through the emergence and contributions of the Solidarity movement, the communist government was dissolved and Poland re-established itself as a semi-presidential democratic republic.<br><br>Poland is a developed market,[22] and a middle power.[23][24][25] It has the sixth largest economy in the European Union by nominal GDP and the fifth largest by GDP (PPP).[26] It provides very high standards of living, safety[27] and economic freedom,[28][29] as well as free university education and a universal health care system.[30][31] The country has 16 UNESCO World Heritage Sites, 15 of which are cultural.[32] Poland is a member state of the Schengen Area, European Union, European Economic Area, the United Nations, NATO, the OECD, the Three Seas Initiative and the Visegrád Group.","poland.png", "Warsaw"],
    ["NL", "Netherlands", "The Netherlands (Dutch: Nederland [ˈneːdərlɑnt] (About this soundlisten)), informally Holland,[14][15] is a country primarily located in Western Europe and partly in the Caribbean. It is the largest of four constituent countries of the Kingdom of the Netherlands.[16][17][18] In Europe, the Netherlands consists of twelve provinces, bordering Germany to the east, Belgium to the south, and the North Sea to the northwest, with maritime borders in the North Sea with those countries and the United Kingdom.[19] In the Caribbean, it consists of three special municipalities: the islands of Bonaire, Sint Eustatius and Saba.[i] The country's official language is Dutch, with West Frisian as a secondary official language in the province of Friesland, and English and Papiamento as secondary official languages in the Caribbean Netherlands.[1] Dutch Low Saxon and Limburgish are recognised regional languages (spoken in the east and southeast respectively), while Sinte Romani and Yiddish are recognised non-territorial languages.[1]<br><br>The four largest cities in the Netherlands are Amsterdam, Rotterdam, The Hague and Utrecht.[21] Amsterdam is the country's most populous city and nominal capital,[22] while The Hague holds the seat of the States General, Cabinet and Supreme Court.[23] The Port of Rotterdam is the busiest seaport in Europe, and the busiest in any country outside East Asia and Southeast Asia, behind only China and Singapore.[24] Amsterdam Airport Schiphol is the busiest airport in the Netherlands, and the third busiest in Europe. The country is a founding member of the EU, Eurozone, G10, NATO, OECD and WTO, as well as a part of the Schengen Area and the trilateral Benelux Union. It hosts several intergovernmental organisations and international courts, many of which are centred in The Hague, which is consequently dubbed 'the world's legal capital'.[25]<br><br>Netherlands literally means \"lower countries\" in reference to its low elevation and flat topography, with only about 50% of its land exceeding 1 m (3.3 ft) above sea level, and nearly 26% falling below sea level.[26] Most of the areas below sea level, known as polders, are the result of land reclamation that began in the 14th century.[27] Colloquially or informally the Netherlands is occasionally referred to by the pars pro toto Holland.[14] With a population of 17.4 million people, all living within a total area of roughly 41,800 km2 (16,100 sq mi)—of which the land area is 33,500 km2 (12,900 sq mi)—the Netherlands is the 16th most densely populated country in the world and the 2nd most densely populated country in the European Union, with a density of 521 km2 (201 sq mi). Nevertheless, it is the world's second-largest exporter of food and agricultural products by value, owing to its fertile soil, mild climate, intensive agriculture and inventiveness.[28][29][30]<br><br>The Netherlands has been a parliamentary constitutional monarchy with a unitary structure since 1848. The country has a tradition of pillarisation and a long record of social tolerance, having legalised abortion, prostitution and human euthanasia, along with maintaining a liberal drug policy. The Netherlands abolished the death penalty in Civil Law in 1870, though it was not completely removed until a new constitution was approved in 1983. The Netherlands allowed women's suffrage in 1919, before becoming the world's first country to legalise same-sex marriage in 2001. Its mixed-market advanced economy had the eleventh-highest per capita income globally.[31] The Netherlands ranks among the highest in international indexes of press freedom,[32] economic freedom,[33] human development and quality of life, as well as happiness.[34][j] In 2020, it ranked eighth on the human development index and fifth on the 2021 World Happiness Index.","nether.png", "Amsterdam"],
    ["LUX", "Luxembourg", "Luxembourg (/ˈlʌksəmbɜːrɡ/ (About this soundlisten) LUK-səm-burg;[8] Luxembourgish: Lëtzebuerg [ˈlətsəbuəɕ] (About this soundlisten); French: Luxembourg; German: Luxemburg), officially the Grand Duchy of Luxembourg,[c] is a landlocked country in Western Europe. It is bordered by Belgium to the west and north, Germany to the east, and France to the south. Its capital, Luxembourg City,[9] is one of the four official capitals of the European Union (together with Brussels, Frankfurt, and Strasbourg) and the seat of the Court of Justice of the European Union, the highest judicial authority in the EU.[10] Its culture, people, and languages are highly intertwined with its neighbors, making it a mixture of French and German cultures. It has three official languages: French, German, and the national language of Luxembourgish.[11]<br><br>With an area of 2,586 square kilometers (998 sq mi), it is one of the smallest sovereign states in Europe.[12] In 2019, Luxembourg had a population of 626,108, which makes it one of the least-populous countries in Europe,[13] but by far the one with the highest population growth rate.[14] Foreigners account for nearly half of Luxembourg's population.[15] As a representative democracy with a constitutional monarch, it is headed by Grand Duke Henri and is the world's only remaining sovereign grand duchy. Luxembourg is a developed country, with an advanced economy and one of the world's highest GDP (PPP) per capita. The City of Luxembourg, with its old quarters and fortifications, was declared a UNESCO World Heritage Site in 1994 due to the exceptional preservation of the vast fortifications and the old city.[16]<br><br>The history of Luxembourg is considered to begin in 963, when count Siegfried acquired a rocky promontory and its Roman-era fortifications known as Lucilinburhuc, \"little castle\", and the surrounding area from the Imperial Abbey of St. Maximin in nearby Trier.[17][18] Siegfried's descendants increased their territory through marriage, war and vassal relations. At the end of the 13th century, the counts of Luxembourg reigned over a considerable territory.[19] In 1308, Count of Luxembourg Henry VII became King of the Germans and later Holy Roman Emperor.[20] The House of Luxembourg produced four emperors during the High Middle Ages. In 1354, Charles IV elevated the county to the Duchy of Luxembourg.[21] The duchy eventually became part of the Burgundian Circle and then one of the Seventeen Provinces of the Habsburg Netherlands.[22] Over the centuries, the City and Fortress of Luxembourg, of great strategic importance situated between the Kingdom of France and the Habsburg territories, was gradually built up to be one of the most reputed fortifications in Europe.[citation needed] After belonging to both the France of Louis XIV and the Austria of Maria Theresa, Luxembourg became part of the First French Republic and Empire under Napoleon.[23]<br><br>The present-day state of Luxembourg first emerged at the Congress of Vienna in 1815. The Grand Duchy, with its powerful fortress, became an independent state under the personal possession of William I of the Netherlands with a Prussian garrison to guard the city against another invasion from France.[24][21] In 1839, following the turmoil of the Belgian Revolution, the purely French-speaking part of Luxembourg was ceded to Belgium and the Luxembourgish-speaking part (except the Arelerland, the area around Arlon) became what is the present state of Luxembourg.[25]<br><br>Luxembourg is a founding member of the European Union,[26] OECD, United Nations, NATO, and Benelux.[27][28] The city of Luxembourg, which is the country's capital and largest city, is the seat of several institutions and agencies of the EU.[29] Luxembourg served on the United Nations Security Council for the years 2013 and 2014, which was a first in the country's history.[30] As of 2020, Luxembourg citizens had visa-free or visa-on-arrival access to 187 countries and territories, ranking the Luxembourgish passport fifth in the world, tied with Denmark and Spain.", "lux.png", "Luxembourg"],
    ["FR", "France", "France (French: [fʁɑ̃s] Listen), officially the French Republic (French: République française),[1] is a country primarily located in Western Europe, consisting of metropolitan France and several overseas regions and territories.[XIII] The metropolitan area of France extends from the Rhine to the Atlantic Ocean and from the Mediterranean Sea to the English Channel and the North Sea. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian Oceans. France borders Belgium, Luxembourg and Germany to the northeast, Switzerland, Monaco and Italy to the east, Andorra and Spain to the south, as well as the Netherlands, Suriname and Brazil in the Americas. The country's eighteen integral regions (five of which are situated overseas) span a combined area of 643,801 km2 (248,573 sq mi) and a total population of 67.413 million (as of May 2021).[12] France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice. France, including its overseas territories, has the most time zones of any country, with a total of twelve.<br><br>During the Iron Age, what is now metropolitan France was inhabited by the Gauls. The area was annexed by Rome in 51 BC, developing a distinct Gallo-Roman culture that laid the foundation of the French language. The Germanic Franks arrived in 476 and formed the Kingdom of Francia, which became the heartland of the Carolingian Empire. The Treaty of Verdun of 843 partitioned the empire, with West Francia becoming the Kingdom of France in 987.<br><br>In the High Middle Ages, France was a highly decentralized feudal kingdom in which the authority of the king was barely felt. King Philip Augustus achieved remarkable success in the strengthening of royal power and the expansion of his realm, doubling its size and defeating his rivals. By the end of his reign, France had emerged as the most powerful state in Europe. In the mid-14th century, French monarchs were embroiled in a series of dynastic conflicts with their English counterparts, collectively known as the Hundred Years' War, from which they ultimately emerged victorious. Disputes with Spain and the Holy Roman Empire soon followed during the Renaissance. Meanwhile, French culture flourished and a global colonial empire was established, which by the 20th century would become the second largest in the world.[13] The second half of the 16th century was dominated by religious civil wars between Catholics and Protestants (Huguenots), which severely weakened the country. But France once again emerged as Europe's dominant cultural, political, and military power in the 17th century under Louis XIV following the Thirty Years' War.[14] Despite the wealth of the nation, an inadequate financial model and inequitable taxation system coupled with endless and costly wars meant that the kingdom was left in a precarious economic situation by the end of the 18th century. Especially costly were the Seven Years' War and American War of Independence. The French Revolution in 1789 saw the fall of the absolute monarchy that characterized the Ancien Régime and from its ashes, rose one of modern history's earliest republics, which drafted the Declaration of the Rights of Man and of the Citizen. The declaration expresses the nation's ideals to this day.<br><br>Following the revolution, France reached its political and military zenith in the early 19th century under Napoleon Bonaparte, subjugating much of continental Europe and establishing the First French Empire. The French Revolutionary and Napoleonic Wars shaped the course of European and world history. After the collapse of the empire and a relative decline, France endured a tumultuous succession of governments culminating in the establishment of the French Third Republic in 1870 in the midst of the Franco-Prussian War. France was one of the prominent participants of World War I, from which it emerged victorious, and was one of the Allied powers in World War II, but came under occupation by the Axis in 1940. Following liberation in 1944, a Fourth Republic was established and later dissolved in the course of the Algerian War. The Fifth Republic, led by Charles de Gaulle, was formed in 1958 and remains to this day. Algeria and nearly all other French colonies became independent in the 1960s, with most retaining close economic and military connections with France.<br><br>France retains its centuries-long status as a global centre of art, science, and philosophy. It hosts the world's fifth-largest number of UNESCO World Heritage Sites and is the leading tourist destination, receiving over 89 million foreign visitors in 2018.[15] France is a developed country with the world's seventh-largest economy by nominal GDP, and the ninth-largest by PPP. In terms of aggregate household wealth, it ranks fourth in the world.[16] France performs well in international rankings of education, health care, life expectancy, and human development.[17][18] It remains a great power in global affairs,[19] being one of the five permanent members of the United Nations Security Council and an official nuclear-weapon state. France is a founding and leading member of the European Union and the Eurozone,[20] and a member of the Group of 7, North Atlantic Treaty Organization (NATO), Organisation for Economic Co-operation and Development (OECD), the World Trade Organization (WTO), and La Francophonie.", "france.png", "Paris"],
    ["DM", "Denmark", "Denmark (Danish: Danmark, pronounced [ˈtænmɑk] (About this soundlisten)), officially the Kingdom of Denmark,[N 11] is a Nordic country in Northern Europe. Denmark proper,[N 2] which is the southernmost of the Scandinavian countries, consists of a peninsula, Jutland, and an archipelago of 443 named islands,[15] with the largest being Zealand, Funen and the North Jutlandic Island. The islands are characterised by flat, arable land and sandy coasts, low elevation and a temperate climate. Denmark lies southwest of Sweden and south of Norway,[N 12] and is bordered to the south by Germany. The Kingdom of Denmark is constitutionally a unitary state comprising Denmark proper and the two autonomous territories[16] in the North Atlantic Ocean: the Faroe Islands and Greenland. Denmark has a total area of 42,943 km2 (16,580 sq mi) as of 2020,[7] and the total area including Greenland and the Faroe Islands is 2,210,579 km2 (853,509 sq mi). Denmark proper has a population of 5.84 million (as of 2021).[17]<br><br>The unified kingdom of Denmark emerged in the 8th century as a proficient seafaring nation in the struggle for control of the Baltic Sea.[6] Denmark, Sweden, and Norway were ruled together under one sovereign ruler in the Kalmar Union, established in 1397 and ending with Swedish secession in 1523. The areas of Denmark and Norway remained under the same monarch until 1814, Denmark–Norway. Beginning in the 17th century, there were several devastating wars with the Swedish Empire, ending with large cessions of territory to Sweden. After the Napoleonic Wars, Norway was ceded to Sweden, while Denmark kept the Faroe Islands, Greenland, and Iceland. In the 19th century there was a surge of nationalist movements, which were defeated in the First Schleswig War. After the Second Schleswig War in 1864, Denmark lost the Duchy of Schleswig to Prussia. Denmark remained neutral during World War I; however, in 1920 the northern half of Schleswig became Danish again. In April 1940, a German invasion saw brief military skirmishes while the Danish resistance movement was active from 1943 until the German surrender in May 1945. An industrialised exporter of agricultural produce in the second half of the 19th century, Denmark introduced social and labour-market reforms in the early 20th century that created the basis for the present welfare state model with a highly developed mixed economy.<br><br>The Constitution of Denmark was signed on 5 June 1849, ending the absolute monarchy, which had begun in 1660. It establishes a constitutional monarchy organised as a parliamentary democracy. The government and national parliament are seated in Copenhagen, the nation's capital, largest city, and main commercial centre. Denmark exercises hegemonic influence in the Danish Realm, devolving powers to handle internal affairs. Home rule was established in the Faroe Islands in 1948; in Greenland home rule was established in 1979 and further autonomy in 2009. Denmark became a member of the European Economic Community (now the EU) in 1973, but negotiated certain opt-outs; it retains its own currency, the krone.<br><br>A developed country, Danes enjoy a high standard of living and the country ranks highly in some metrics of national performance, including education, health care, protection of civil liberties, democratic governance and LGBT equality.[18][19][20][21] It is among the founding members of NATO, the Nordic Council, the OECD, OSCE, and the United Nations; it is also part of the Schengen Area. Denmark also has close ties to its Scandinavian neighbours linguistically, with the Danish language being partially mutually intelligible with both Norwegian and Swedish.","denmark.png", "Copenhagen"],
    ["CZ", "Czech Republic", "The Czech Republic, also known by its short-form name, Czechia, formerly known as Bohemia,[13] is a landlocked country in Central Europe. It is bordered by Austria to the south, Germany to the west, Poland to the northeast, and Slovakia to the east.[14] The Czech Republic has a hilly landscape that covers an area of 78,866 square kilometers (30,450 sq mi) with a mostly temperate continental climate and oceanic climate. It is a unitary parliamentary republic.<br><br> The Duchy of Bohemia under Great Moravia in 1002 was formally recognized as an Imperial State of the Holy Roman Empire and became a kingdom in 1198.[15][16] Following the Battle of Mohács in 1526, the whole Crown of Bohemia was gradually integrated into the Habsburg Monarchy. The Protestant Bohemian Revolt led to the Thirty Years' War. After the Battle of the White Mountain, the Habsburgs consolidated their rule. With the dissolution of the Holy Empire in 1806, the Crown lands became part of the Austrian Empire.<br><br> In the 19th century, the Czech lands became more industrialized, and in 1918 most of it became part of the First Czechoslovak Republic following the collapse of Austria-Hungary after World War I.[17] After the Munich Agreement in 1938, Nazi Germany systematically took control over the Czech lands. Czechoslovakia was restored in 1945 and became an Eastern Bloc communist state following a coup d'état in 1948. In November 1989, the Velvet Revolution ended communist rule in the country, and on 1 January 1993, Czechoslovakia was dissolved, with its constituent states becoming the independent states of the Czech Republic and Slovakia.<br><br> The Czech Republic is a developed country with an advanced, high-income social market economy. It is a welfare state with a European social model, universal health care and tuition-free university education. It ranks 12th in the UN inequality-adjusted human development and 14th in the World Bank Human Capital Index ahead of countries such as the United States, the United Kingdom and France. It ranks as the 11th safest and most peaceful country and 31st in democratic governance. The Czech Republic is a member of NATO, the EU, OECD, OSCE, and the CoE.", "czech.png", "Prague"],
    ["BE", "Belgium", "Belgium (Dutch: België [ˈbɛlɣijə] (About this soundlisten); French: Belgique [bɛlʒik] (About this soundlisten); German: Belgien [ˈbɛlɡi̯ən] (About this soundlisten)), officially the Kingdom of Belgium, is a country in Western Europe. It is bordered by the Netherlands to the north, Germany to the east, Luxembourg to the southeast, France to the southwest, and the North Sea to the northwest. It covers an area of 30,689 km2 (11,849 sq mi) and has a population of more than 11.5 million, making it the 22nd most densely populated country in the world and the 6th most densely populated country in Europe, with a density of 376 per square kilometre (970/sq mi). The capital and largest city is Brussels; other major cities are Antwerp, Ghent, Charleroi, Liège, Bruges, Namur, and Leuven.<br><br>Belgium is a sovereign state and a federal constitutional monarchy with a parliamentary system. Its institutional organization is complex and is structured on both regional and linguistic grounds. It is divided into three highly autonomous regions:[10] the Flemish Region (Flanders) in the north, the Walloon Region (Wallonia) in the south, and the Brussels-Capital Region.[11] Brussels is the smallest and most densely populated region, as well as the richest region in terms of GDP per capita.<br><br>Belgium is home to two main linguistic communities: the Dutch-speaking Flemish Community, which constitutes about 60 percent of the population, and the French-speaking Community, which constitutes about 40 percent of the population. A small German-speaking Community, numbering around one percent, exists in the East Cantons. The Brussels-Capital Region is officially bilingual in French and Dutch,[12] although French is the dominant language.[13] Belgium's linguistic diversity and related political conflicts are reflected in its political history and complex system of governance, made up of six different governments.<br><br>Belgium is part of an area known as the Low Countries, a somewhat larger region than the current Benelux group of states that also historically included parts of northern France and western Germany. Its modern name is derived from the Latin word Belgium, used in Julius Caesar's \"Gallic Wars\", to describe the region in the period around 55 BCE.[14] From the end of the Middle Ages until the 17th century, the area of Belgium was a prosperous and cosmopolitan centre of commerce and culture.[clarification needed] Between the 16th and early 19th centuries, Belgium served as the battleground between many European powers, earning the moniker the \"Battlefield of Europe\",[15] a reputation strengthened in the 20th century by both world wars. The country emerged in 1830 following the Belgian Revolution, when it seceded from the Netherlands.<br><br>Belgium participated in the Industrial Revolution[16][17] and, during the course of the 20th century, possessed a number of colonies in Africa.[18] Between 1888 and 1908, Leopold II, king of Belgium, perpetrated one of the largest massacres in human history in Congo Free State, his private estate (and not a colony of Belgium at that time) causing the deaths of an estimated five to fifteen million Congolese people, during the production of massive amounts of rubber and ivory.[19]<br><br>The second half of the 20th century was marked by rising tensions between the Dutch-speaking and the French-speaking citizens fuelled by differences in language and culture and the unequal economic development of Flanders and Wallonia. This continuing antagonism has led to several far-reaching reforms, resulting in a transition from a unitary to a federal arrangement during the period from 1970 to 1993. Despite the reforms, tensions between the groups have remained, if not increased; there is significant separatism particularly among the Flemish; controversial language laws exist such as the municipalities with language facilities;[20] and the formation of a coalition government took 18 months following the June 2010 federal election, a world record.[21] Unemployment in Wallonia is more than double that of Flanders, which boomed after the war.[22]<br><br>Belgium is one of the six founding countries of the European Union and its capital, Brussels, hosts the official seats of the European Commission, the Council of the European Union, and the European Council, as well as one of two seats of the European Parliament (the other being Strasbourg). Belgium is also a founding member of the Eurozone, NATO, OECD, and WTO, and a part of the trilateral Benelux Union and the Schengen Area. Brussels hosts the headquarters of many major international organizations such as NATO.[A]<br><br>Belgium is a developed country, with an advanced high-income economy. It has very high standards of living, quality of life,[23] healthcare,[24] education,[25] and is categorized as \"very high\" in the Human Development Index.[26] It also ranks as one of the safest or most peaceful countries in the world.", "belgium.png", "Brussels"],
    ["AU", "Austria", "Austria (/ˈɒstriə/ (About this soundlisten), /ˈɔːs-/;[10] German: Österreich [ˈøːstɐʁaɪ̯ç] (About this soundlisten)), officially the Republic of Austria (German: Republik Österreich, About this soundlisten (help·info)), is a landlocked East Alpine country in the southern part of Central Europe. It is composed of nine federated states (Bundesländer), one of which is Vienna, Austria's capital and largest city. It is bordered by Germany to the northwest, the Czech Republic to the north, Slovakia to the northeast, Hungary to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. Austria occupies an area of 83,879 km2 (32,386 sq mi) and has a population of nearly 9 million people. While German is the country's official language,[11] many Austrians communicate informally in a variety of Bavarian dialects.[12]<br><br>Austria initially emerged as a margraviate around 976 and developed into a duchy and archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal dynasties in history. As an archduchy, it was a major component and administrative centre of the Holy Roman Empire. Early in the 19th century, Austria established its own empire, which became a great power and the leading force of the German Confederation, but pursued its own course independently of the other German states following its defeat in the Austro-Prussian War in 1866. In 1867, in compromise with Hungary, the Austria-Hungary Dual Monarchy was established.<br><br>Austria was involved in World War I under Emperor Franz Joseph following the assassination of Archduke Ferdinand, the presumptive successor to the Austro-Hungarian throne. After the defeat and the dissolution of the Monarchy, the Republic of German-Austria was proclaimed with the intent of union with Germany, but the Allied Powers did not support the new state and it remained unrecognized. In 1919 the First Austrian Republic became the legal successor of Austria. In 1938, the Austrian-born Adolf Hitler, who became the Chancellor of the German Reich, achieved the annexation of Austria by the Anschluss. Following the defeat of Nazi Germany in 1945 and an extended period of Allied occupation, Austria was re-established as a sovereign and self-governing democratic nation known as the Second Republic.<br><br>Austria is a parliamentary representative democracy with a directly elected Federal President as head of state and a Chancellor as head of the federal government. Major urban areas of Austria include Vienna, Graz, Linz, Salzburg and Innsbruck. Austria is consistently ranked in the top 20 richest countries in the world by GDP per capita terms. The country has achieved a high standard of living and in 2018 was ranked 20th in the world for its Human Development Index. Vienna consistently ranks in the top internationally on quality-of-life indicators.[13]<br><br>The Second Republic declared its perpetual neutrality in foreign political affairs in 1955. Austria has been a member of the United Nations since 1955 and[14] joined the European Union in 1995.[15] It plays host to the OSCE and OPEC and is a founding member of the OECD and Interpol.[16] Austria also signed the Schengen Agreement in 1995,[17] and adopted the euro currency in 1999.", "austria.png", "Vienna"],
    ["NS", "North Sea", "The North Sea is a sea of the Atlantic Ocean between Great Britain (specifically England and Scotland), Jutland (in Denmark), Norway, two States of Germany, the Netherlands, Belgium and Hauts-de-France (in France). An epeiric (or \"shelf\") sea on the European continental shelf, it connects to the ocean through the English Channel in the south and the Norwegian Sea in the north. It is more than 970 kilometres (600 mi) long and 580 kilometres (360 mi) wide, covering 570,000 square kilometres (220,000 sq mi).<br><br>It has long hosted key north European shipping lanes as well as provided a major fishery. The coast is a popular destination for recreation and tourism in bordering countries, and more recently the sea has developed into a rich source of energy resources, including fossil fuels, wind, and early efforts in wave power.<br><br>Historically, the North Sea has featured prominently in geopolitical and military affairs, particularly in Northern Europe. It was also important globally through the power northern Europeans projected worldwide during much of the Middle Ages and into the modern era. The North Sea was the centre of the Vikings' rise. Subsequently, the Hanseatic League, the Dutch Republic, and the British each sought to gain command of the North Sea and thus access to the world's markets and resources. As Germany's only outlet to the ocean, the North Sea continued to be strategically important through both World Wars.<br><br>The coast has diverse geology and geography. In the north, deep fjords and sheer cliffs mark much of its Norwegian and Scottish coastlines respectively, whereas in the south, the coast consists mainly of sandy beaches, estuaries of long rivers and wide mudflats. Due to the dense population, heavy industrialization, and intense use of the sea and area surrounding it, there have been various environmental issues affecting the sea's ecosystems. Adverse environmental issues – commonly including overfishing, industrial and agricultural runoff, dredging, and dumping, among others – have led to a number of efforts to prevent degradation and to safeguard the long-term economic benefits.", "north.png", ""],
    ["BS", "Baltic Sea", "The Baltic Sea is an arm of the Atlantic Ocean, enclosed by Denmark, Estonia, Finland, Germany, Latvia, Lithuania, Poland, Russia, Sweden and the North and Central European Plain.<br><br>The sea stretches from 53°N to 66°N latitude and from 10°E to 30°E longitude. A marginal sea of the Atlantic, with limited water exchange between the two water bodies, the Baltic Sea drains through the Danish Straits into the Kattegat by way of the Øresund, Great Belt and Little Belt. It includes the Gulf of Bothnia, the Bay of Bothnia, the Gulf of Finland, the Gulf of Riga and the Bay of Gdańsk.<br><br>The Baltic Proper is bordered on its northern edge, at latitude 60°N, by the Åland Islands and the Gulf of Bothnia, on its northeastern edge by the Gulf of Finland, on its eastern edge by the Gulf of Riga, and in the west by the Swedish part of the southern Scandinavian Peninsula.<br><br>The Baltic Sea is connected by artificial waterways to the White Sea via the White Sea-Baltic Canal and to the German Bight of the North Sea via the Kiel Canal.", "balt.png", ""],
    ["VOID", "Other countries", "We don't talk about those", "europe.png", ""],
    ["XZUGSPITZE", "Zugspitze", "The Zugspitze, (German pronunciation: [ˈtsuːkʃpɪtsə]) at 2,962 m (9,718 ft) above sea level, is the highest peak of the Wetterstein Mountains as well as the highest mountain in Germany. It lies south of the town of Garmisch-Partenkirchen, and the Austria–Germany border runs over its western summit. South of the mountain is the Zugspitzplatt, a high karst plateau with numerous caves. On the flanks of the Zugspitze are three glaciers, including the two largest in Germany: the Northern Schneeferner with an area of 30.7 hectares and the Höllentalferner with an area of 24.7 hectares. The third is the Southern Schneeferner which covers 8.4 hectares.[needs update]<br><br>The Zugspitze was first climbed on 27 August 1820 by Josef Naus, his survey assistant, Maier, and mountain guide, Johann Georg Tauschl. Today there are three normal routes to the summit: one from the Höllental valley to the northeast; another out of the Reintal valley to the southeast; and the third from the west over the Austrian Cirque (Österreichische Schneekar). One of the best known ridge routes in the Eastern Alps runs along the knife-edged Jubilee Ridge (Jubiläumsgrat) to the summit, linking the Zugspitze, the Hochblassen and the Alpspitze. For mountaineers there is plenty of nearby accommodation. On the western summit of the Zugspitze itself is the Münchner Haus and on the western slopes is the Wiener-Neustädter Hut.<br><br>Three cable cars run to the top of the Zugspitze. The first, the Tyrolean Zugspitze Cable Car, was built in 1926 by the German company Adolf Bleichert & Co [4] and terminated on an arête below the summit at 2,805 m.a.s.l, the so-called Kammstation, before the terminus was moved to the actual summit at 2,951 m.a.s.l. in 1991. A rack railway, the Bavarian Zugspitze Railway, runs inside the northern flank of the mountain and ends on the Zugspitzplatt, from where a second cable car takes passengers to the top. The rack railway and the Eibsee Cable Car, the third cableway, transport an average of 500,000 people to the summit each year. In winter, nine ski lifts cover the ski area on the Zugspitzplatt. The weather station, opened in 1900, and the research station in the Schneefernerhaus are mainly used to conduct climate research.", "zug.jpg", "Highest Mountain in Germany"],
    ["XBURGHAUSEN", "Burghausen Castle", "Burghausen Castle in Burghausen, Upper Bavaria, is the longest castle complex in the world (1051 m), confirmed by the Guinness World Record company.<br><br>The gothic castle comprises the main castle with the inner courtyard and five outer courtyards.<br><br>The castle hill was settled as early as the Bronze Age. The castle (which was founded before 1025) was transferred to the Wittelsbachs after the death of the last count of Burghausen, Gebhard II, in 1168. In 1180 they were appointed dukes of Bavaria and the castle was extended under Duke Otto I of Wittelsbach.<br><br>With the first partition of Bavaria in 1255, Burghausen Castle became the second residence of the dukes of Lower Bavaria, the main residence being Landshut. The work on the main castle commenced in 1255 under Duke Henry XIII (1253–1290). In 1331 Burghausen and its castle passed to Otto IV, Duke of Lower Bavaria.<br><br>Under the dukes of Bavaria-Landshut (1392-1503), the fortifications were extended around the entire castle hill. Starting with Margarete of Austria, the deported wife of the despotic Duke Henry XVI (1393–1450), the castle became the residence of the Duke's consorts and widows, and also a stronghold for the ducal treasures. In 1447 Louis VII, Duke of Bavaria died in the castle as Henry's prisoner. Under Duke Georg of Bavaria (1479–1503) the work was completed and Burghausen Castle became the strongest fortress of the region.<br><br>After the reunification of Bavaria in 1505 with the Landshut War of Succession the castle had military importance, and due to the threat of the Ottoman Empire it was subsequently modernised. During the Thirty Years War, Gustav Horn was kept imprisoned in the castle from 1634 to 1641. After the Treaty of Teschen in 1779 Burghausen Castle became a border castle. During the Napoleonic Wars the castle suffered some destruction. The 'Liebenwein tower' was occupied by the painter Maximilian Liebenwein from 1899 until his death. He decorated the interior in the Art Nouveau style.", "burg.jpg", "Largest castle in Europe"],
    ["XCONSTANCE", "Lake Constance", "Lake Constance (German: Bodensee) refers to three bodies of water on the Rhine at the northern foot of the Alps: Upper Lake Constance (Obersee), Lower Lake Constance (Untersee), and a connecting stretch of the Rhine, called the Lake Rhine (Seerhein). These waterbodies lie within the Lake Constance Basin (Bodenseebecken), which is part of the Alpine Foreland and through which the Rhine flows.<br><br>The lake is situated where Germany, Switzerland, and Austria meet. Its shorelines lie in the German states of Baden-Württemberg and Bavaria, the Swiss cantons of St. Gallen, Thurgau, and Schaffhausen, and the Austrian state of Vorarlberg. The Rhine flows, as Alpine Rhine, into the lake from the south, with its original course forming the Austro-Swiss border, and has its outflow on the Lower Lake where — except for Schaffhausen — it forms, as High Rhine, the German-Swiss border as far as the city of Basel.[4][5]<br><br>The most populous towns on the Upper Lake are Constance (German: Konstanz), Friedrichshafen, Bregenz, Lindau (Bodensee), Überlingen and Kreuzlingen. The largest town on the Lower Lake is Radolfzell am Bodensee. The largest islands are Reichenau in the Lower Lake, and Lindau and Mainau in the Upper Lake.<br><br>While in English and the Romance languages, the lake is named after the city of Constance, the German name derives from the village of Bodman (municipality of Bodman-Ludwigshafen), in the northwesternmost corner of the lake.", "lake.jpg", "Largest lake in Germany"],
    ["CSTUTTGARD", "Stuttgard", "Stuttgart (German: [ˈʃtʊtɡaʁt] (About this soundlisten); Swabian: Schduagert [ˈʒ̊d̥ua̯ɡ̊ɛʕd̥]; names in other languages) is the capital and largest city of the German state of Baden-Württemberg. It is located on the Neckar river in a fertile valley known locally as the \"Stuttgart Cauldron\" and lies an hour from the Swabian Jura and the Black Forest. Its area has a population of 635,911,[4] making it the sixth largest city in Germany.[5] 2.8 million people live in the city's administrative region[2] and 5.3 million people in its metropolitan area,[1] making it the fourth largest metropolitan area in Germany. The city and metropolitan area are consistently ranked among the top 20 European metropolitan areas by GDP; Mercer listed Stuttgart as 21st on its 2015 list of cities by quality of living,[a][6] innovation agency 2thinknow ranked the city 24th globally out of 442 cities[b][7] and the Globalization and World Cities Research Network ranked the city as a Beta-status global city in their 2014 survey.[8] Stuttgart was one of the host cities for the official tournaments of the 1974 and 2006 FIFA World Cups.<br><br>Since the 7th millennium BC, the Stuttgart area has been an important agricultural area and has been host to a number of cultures seeking to utilize the rich soil of the Neckar valley. The Roman Empire conquered the area in 83 AD and built a massive castrum near Bad Cannstatt, making it the most important regional centre for several centuries. Stuttgart's roots were truly laid in the 10th century with its founding by Liudolf, Duke of Swabia, as a stud farm for his warhorses. Initially overshadowed by nearby Bad Cannstatt, the town grew steadily and was granted a charter in 1320. The fortunes of Stuttgart turned with those of the House of Württemberg, and they made it the capital of their county, duchy, and kingdom from the 15th century to 1918. Stuttgart prospered despite setbacks in the Thirty Years' War and devastating air raids by the Allies on the city and its automobile production during World War II. However, by 1952, the city had bounced back and it became the major economic, industrial, tourism and publishing centre it is today.[9]<br><br>Stuttgart is also a transport junction, and possesses the sixth-largest airport in Germany. Several major companies are headquartered in Stuttgart, including Porsche,[10] Bosch,[11] Mercedes-Benz[12] and Daimler AG.[13]<br><br>Stuttgart is unusual in the scheme of German cities.[14] It is spread across a variety of hills (some of them covered in vineyards),[15] valleys (especially around the Neckar river and the Stuttgart basin) and parks. This often surprises visitors who associate the city with its reputation as the \"cradle of the automobile\".[16][17] The city's tourism slogan is \"Stuttgart offers more\".[18] Under current plans to improve transport links to the international infrastructure (as part of the Stuttgart 21 project), the city unveiled a new logo and slogan in March 2008, describing itself as \"Das neue Herz Europas\" (\"The new Heart of Europe\").[19] For business, it describes itself as \"Where business meets the future\". In July 2010, Stuttgart unveiled a new city logo, designed to entice more business people to stay in the city and enjoy breaks in the area.[20]<br><br>Stuttgart is a city with a high number of immigrants. According to Dorling Kindersley's Eyewitness Travel Guide to Germany, \"In the city of Stuttgart, every third inhabitant is a foreigner.\"[21] 40% of Stuttgart's residents, and 64% of the population below the age of five, are of immigrant background.", "stutt.jpg", "Capital of Baden-Württemberg"],
    ["CMUNICH", "Munich", "Munich (/ˈmjuːnɪk/ MEW-nik; German: München [ˈmʏnçn̩] (About this soundlisten); Bavarian: Minga [ˈmɪŋ(ː)ɐ]) is the capital and most populous city of Bavaria. With a population of 1,558,395 inhabitants as of 31 July 2020,[3] it is the third-largest city in Germany, after Berlin and Hamburg, and thus the largest which does not constitute its own state, as well as the 11th-largest city in the European Union. The city's metropolitan region is home to 6 million people.[4]<br><br>Straddling the banks of the River Isar (a tributary of the Danube) north of the Bavarian Alps, it is the seat of the Bavarian administrative region of Upper Bavaria, while being the most densely populated municipality in Germany (4,500 people per km2). Munich is the second-largest city in the Bavarian dialect area, after the Austrian capital of Vienna.<br><br>The city was first mentioned in 1158. Catholic Munich strongly resisted the Reformation and was a political point of divergence during the resulting Thirty Years' War, but remained physically untouched despite an occupation by the Protestant Swedes.[5] Once Bavaria was established as a sovereign kingdom in 1806, Munich became a major European centre of arts, architecture, culture and science. In 1918, during the German Revolution, the ruling house of Wittelsbach, which had governed Bavaria since 1180, was forced to abdicate in Munich and a short-lived socialist republic was declared. In the 1920s, Munich became home to several political factions, among them the NSDAP. After the Nazis' rise to power, Munich was declared their \"Capital of the Movement\". The city was heavily bombed during World War II, but has restored most of its traditional cityscape. After the end of postwar American occupation in 1949, there was a great increase in population and economic power during the years of Wirtschaftswunder, or \"economic miracle\". The city hosted the 1972 Summer Olympics and was one of the host cities of the 1974 and 2006 FIFA World Cups.<br><br>Today, Munich is a global centre of art, science, technology, finance, publishing, culture, innovation, education, business, and tourism and enjoys a very high standard and quality of living, reaching first in Germany and third worldwide according to the 2018 Mercer survey,[6] and being rated the world's most liveable city by the Monocle's Quality of Life Survey 2018.[7] According to the Globalization and World Rankings Research Institute, Munich is considered an alpha-world city, as of 2015.[8] It is one of the most prosperous[9] and fastest growing[10] cities in Germany.<br><br>Munich's economy is based on high tech, automobiles, the service sector and creative industries, as well as IT, biotechnology, engineering and electronics among many others. The city houses many multinational companies, such as BMW, Siemens, MAN, Linde, Allianz and MunichRE. It is also home to two research universities, a multitude of scientific institutions, and world class technology and science museums like the Deutsches Museum and BMW Museum.[11] Munich's numerous architectural and cultural attractions, sports events, exhibitions and its annual Oktoberfest attract considerable tourism.[12] The city is home to more than 530,000 people of foreign background, making up 37.7% of its population.", "munich.jpg", "Capital of Bavaria"],
    ["CPOTSDAM", "Potsdam", "Potsdam (German pronunciation: [ˈpɔt͡sdam] (About this soundlisten)) is the capital and largest city of the German state of Brandenburg. It directly borders the German capital, Berlin, and is part of the Berlin/Brandenburg Metropolitan Region. It is situated on the River Havel some 25 kilometres (16 miles) southwest of Berlin's city centre.<br><br>Potsdam was a residence of the Prussian kings and the German Kaiser until 1918. Its planning embodied ideas of the Age of Enlightenment: through a careful balance of architecture and landscape, Potsdam was intended as \"a picturesque, pastoral dream\" which would remind its residents of their relationship with nature and reason.[2]<br><br>The city which is over 1000 years old is widely known for its palaces, its lakes, and its overall historical and cultural significance. Landmarks include the parks and palaces of Sanssouci, Germany's largest World Heritage Site, as well as other palaces such as the Orangery Palace, the New Palace, the Cecilienhof Palace, or the Charlottenhof Palace. Potsdam was also the location of the significant Potsdam Conference in 1945, the conference where the three heads of government of the USSR, the US, and the UK decided on the division of Germany following its surrender, a conference which defined Germany's history for the following 45 years.<br><br>Babelsberg, in the south-eastern part of Potsdam, was already by the 1930s the home of a major film production studio and it has enjoyed success as an important center of European film production since the fall of the Berlin Wall. The Filmstudio Babelsberg is the oldest large-scale film studio in the world.[3]<br><br>Potsdam developed into a centre of science in Germany in the 19th century. Today, there are three public colleges, the University of Potsdam, and more than 30 research institutes in the city.", "pots.jpg", "Capital of Brandenburg"],
    ["CWIESBADEN", "Wiesbaden", "Wiesbaden (German pronunciation: [ˈviːsˌbaːdn̩] (About this soundlisten)) is a city in central western Germany and the capital of the state of Hesse. As of June 2020, it had 290,955 inhabitants,[2] plus approximately 19,000[3] United States citizens (mostly associated with the United States Army). The Wiesbaden urban area is home to approximately 560,000 people. Wiesbaden is the second-largest city in Hesse after Frankfurt am Main.<br><br>The city, together with nearby Frankfurt am Main, Darmstadt, and Mainz, is part of the Frankfurt Rhine Main Region, a metropolitan area with a combined population of about 5.8 million people.<br><br>Wiesbaden is one of the oldest spa towns in Europe. Its name translates to \"meadow baths\", a reference to its famed hot springs. It is also internationally famous for its architecture and climate—it is also called the \"Nice of the North\" in reference to the city in France.[4] At one time, Wiesbaden boasted 26 hot springs. As of 2008, fourteen of the springs are still flowing.[5]<br><br>In 1970, the town hosted the tenth Hessentag Landesfest (English: Hessian Day, a state festival).<br><br>The city is considered the tenth richest in Germany (2014) boasting 110.3% of the national average gross domestic product in 2017. The average annual buying power per citizen is €24,783.", "wies.jpg", "Capital of Hesse"],
    ["CHANOVER", "Hanover", "Hanover (/ˈhænoʊvər, -nəv-/; German: Hannover [haˈnoːfɐ] (About this soundlisten); Low German: Hannober) is the capital and largest city of the German state of Lower Saxony. Its 535,061 (2017) inhabitants make it the 13th-largest city in Germany as well as the third-largest city in Northern Germany after Hamburg and Bremen. Hanover's urban area comprises the towns of Garbsen, Langenhagen and Laatzen and has a population of about 791,000 (2018).[3] The Hanover Region has approximately 1.16 million inhabitants (2019).[4]<br><br>The city lies at the confluence of the River Leine (progression: Aller→ Weser→ North Sea) and its tributary Ihme, in the south of the North German Plain, and is the largest city in the Hannover–Braunschweig–Göttingen–Wolfsburg Metropolitan Region. It is the fifth-largest city in the Low German dialect area after Hamburg, Dortmund, Essen and Bremen.<br><br>Before it became the capital of Lower Saxony in 1946, Hanover was the capital of the Principality of Calenberg (1636–1692), the Electorate of Hanover (1692–1814), the Kingdom of Hanover (1814–1866), the Province of Hanover of the Kingdom of Prussia (1868–1918), the Province of Hanover of the Free State of Prussia (1918–1946) and of the State of Hanover (1946). From 1714 to 1837 Hanover was by personal union the family seat of the Hanoverian Kings of the United Kingdom of Great Britain and Ireland, under their title of the dukes of Brunswick-Lüneburg (later described as the Elector of Hanover).<br><br>The city is a major crossing point of railway lines and motorways (Autobahnen), connecting European main lines in both the east-west (Berlin–Ruhr area/Düsseldorf/Cologne) and north-south (Hamburg–Frankfurt/Stuttgart/Munich) directions. Hannover Airport lies north of the city, in Langenhagen, and is Germany's ninth-busiest airport. The city's most notable institutes of higher education are the Hannover Medical School (Medizinische Hochschule Hannover), one of Germany's leading medical schools, with its university hospital Klinikum der Medizinischen Hochschule Hannover, and the Leibniz University Hannover.<br><br>The Hanover fairground, owing to numerous extensions, especially for the Expo 2000, is the largest in the world. Hanover hosts annual commercial trade fairs such as the Hanover Fair and up to 2018 the CeBIT. The IAA Commercial Vehicles show takes place every two years. It is the world's leading trade show for transport, logistics and mobility. Every year Hanover hosts the Schützenfest Hannover, the world's largest marksmen's festival, and the Oktoberfest Hannover.<br><br>'Hanover' is the traditional English spelling. The German spelling (with a double n) is becoming more popular in English; recent editions of encyclopedias prefer the German spelling,[5][6] and the local government uses the German spelling on English websites.[7] The English pronunciation, with stress on the first syllable, is applied to both the German and English spellings, which is different from German pronunciation, with stress on the second syllable and a long second vowel. The traditional English spelling is still used in historical contexts, especially when referring to the British House of Hanover.", "hanover.jpg", "Capital of Lower Saxony"],
    ["CSCHWERIN", "Schwerin", "Schwerin (UK: /ʃvɛˈriːn/, US: /ʃveɪˈriːn/, German: [ʃveˈʁiːn] (About this soundlisten); Mecklenburgian Low German: Swerin; Latin: Suerina, Suerinum) is the capital and second-largest city of the northeastern German state of Mecklenburg-Vorpommern as well as of the region of Mecklenburg, after Rostock. It has around 96,000 inhabitants, and is thus the least populous of all German state capitals.<br><br>Schwerin is located on the southwestern shore of Lake Schwerin (German:Schweriner See), one of the largest lakes of the Mecklenburg Lake Plateau, and there are eleven other lakes within its city limits. The city is surrounded by the district of Northwestern Mecklenburg to the north, and the district of Ludwigslust-Parchim to the south. Schwerin lies in the east of the Hamburg Metropolitan Region. The name of the city is of Slavic origin, deriving from the root zvěŕ (wild animal) or zvěŕin (game reserve, animal garden, stud farm).<br><br>Schwerin was first mentioned in 1018 as Zuarina and was granted city rights in 1160 by Henry the Lion, thus it is the oldest city of Mecklenburg-Vorpommern. From 1379 to 1815, the city was, as main residence of the House of Mecklenburg, the capital of the Duchy of Mecklenburg-Schwerin, and from 1815, when the duke was elevated to the title of a grand duke, to 1918, the capital of the Grand Duchy of Mecklenburg-Schwerin. The city is known for the romantic Schwerin Palace with its characteristic golden dome and its Niklot statue, that is situated on an island in Lake Schwerin. The dukes and grand dukes of Mecklenburg-Schwerin ruled from there, and since 1990, the palace is the official seat of the state parliament of Mecklenburg-Vorpommern. The city also has a largely intact old town, thanks to only minor damage in World War II.<br><br>Major industries and employers include high technology, machine building, healthcare, government agencies, railway supply, consumer goods and tourism. Schwerin has three academic colleges, the FHM, HdBA and the Design School.", "schw.jpg", "Capital of Mecklenburg-Vorpommern"],
    ["CDUSSELDORF", "Düsseldorf", "Düsseldorf (UK: /ˈdʊsəldɔːrf/, US: /ˈdjuːs-/,[3][4][5] German: [ˈdʏsl̩dɔʁf] (About this soundlisten); often Dusseldorf in English sources; Low Franconian and Ripuarian:[a] Düsseldörp [ˈdʏsl̩dœɐ̯p]; archaic Dutch: Dusseldorp) is the capital city of North Rhine-Westphalia, the most populous state of Germany. It is the second-largest city in the state and the seventh-largest city in Germany, with a population of 617,280.[6]<br><br>It is located at the confluence of two rivers: the Rhine and the Düssel, a small tributary. The \"-dorf\" suffix means \"village\" in German (English cognate: thorp); its use is unusual for a settlement as large as Düsseldorf. Most of the city lies on the right bank of the Rhine (unlike Cologne, which is on the river's left bank). Düsseldorf lies in the centre of both the Rhine-Ruhr and the Rhineland Metropolitan Region. It neighbours the Cologne Bonn Region to the south and the Ruhr to the north. It is the largest city in the German Low Franconian dialect area (closely related to Dutch).<br><br>Mercer's 2012 Quality of Living survey ranked Düsseldorf the sixth most livable city in the world.[7][8] Düsseldorf Airport is Germany's third-busiest airport after those of Frankfurt and Munich, serving as the most important international airport for the inhabitants of the densely populated Ruhr, Germany's largest urban area. Düsseldorf is an international business and financial centre, renowned for its fashion and trade fairs,[9][10][11] and is headquarters to one Fortune Global 500 and two DAX companies. Messe Düsseldorf organises nearly one fifth of premier trade shows.[12] As second largest city of the Rhineland, Düsseldorf holds Rhenish Carnival celebrations every year in February/March, the Düsseldorf carnival celebrations being the third most popular in Germany after those held in Cologne and Mainz.[13]<br><br>There are 22 institutions of higher education in the city including the Heinrich-Heine-Universität Düsseldorf, the university of applied sciences (Hochschule Düsseldorf), the academy of arts (Kunstakademie Düsseldorf, whose members include Joseph Beuys, Emanuel Leutze, August Macke, Gerhard Richter, Sigmar Polke, and Andreas Gursky), and the university of music (Robert-Schumann-Musikhochschule Düsseldorf). The city is also known for its influence on electronic/experimental music (Kraftwerk) and its Japanese community.", "duss.jpg", "Capital of North Rhine-Westphalia"],
    ["CMAINZ", "Mainz", "Mainz (/maɪnts/; German: [maɪ̯nt͡s] (About this soundlisten); Latin: Mogontiacum) is the capital and largest city of Rhineland-Palatinate, Germany.<br><br>Most of the city is upstream of the Rhine before it flows west. The north of the city faces Wiesbaden, in Hesse, and the east the confluence of the Main.<br><br>Mainz is an independent city with a population of 218,578 (as of 2019) and forms part of the Frankfurt Rhine-Main Metropolitan Region.[3]<br><br>Mainz was founded by the Romans in the 1st century BC as a military fortress on the northernmost frontier of the empire and provincial capital of Germania Superior. Mainz became an important city in the 8th century AD as part of the Holy Roman Empire, capital of the Electorate of Mainz and seat of the Archbishop-Elector of Mainz, the Primate of Germany. Mainz is famous as the birthplace of Johannes Gutenberg, the inventor of the movable-type printing press, who in the early 1450s manufactured his first books in the city, including the Gutenberg Bible. Mainz was heavily damaged in World War II; more than 30 air raids destroyed most of the historic buildings.<br><br>Mainz is notable as a transport hub, for wine production, and for its many rebuilt historic buildings.", "mainz.jpg", "Capital of Rhineland-Palatinate"],
    ["CSAARBRUCKEN", "Saarbrücken", "Saarbrücken (German: [zaːɐ̯ˈbʁʏkn̩] (About this soundlisten); French: Sarrebruck[4] [saʁbʁyk]; Rhine Franconian: Saarbrigge [zaːˈbʁɪɡə]; Latin: Saravipons) is the capital and largest city of the state of Saarland, Germany. Saarbrücken is Saarland's administrative, commercial and cultural centre and is next to the French border.<br><br>The modern city of Saarbrücken was created in 1909 by the merger of three towns, Saarbrücken, St. Johann, and Malstatt-Burbach. It was the industrial and transport centre of the Saar coal basin. Products included iron and steel, sugar, beer, pottery, optical instruments, machinery, and construction materials.<br><br>Historic landmarks in the city include the stone bridge across the Saar (1546), the Gothic church of St. Arnual, the 18th-century Saarbrücken Castle, and the old part of the town, the Sankt Johanner Markt (Market of St. Johann).<br><br>In the 20th century, Saarbrücken was twice separated from Germany: from 1920–1935 as capital of the Territory of the Saar Basin and from 1947–1956 as capital of the Saar Protectorate.", "saar.jpg", "Capital of Saarland"],
    ["CDRESDEN", "Dresden", "Dresden (/ˈdrɛzdən/, German: [ˈdʁeːsdn̩] (About this soundlisten); Upper Sorbian: Drježdźany) is the capital city of the German state of Saxony and its second most populous city, after Leipzig. It is the 12th most populous city of Germany, the fourth largest by area (following Berlin, Hamburg and Cologne), and the third most populous city in the area of former East Germany, following Berlin and Leipzig. Dresden's urban area comprises the towns of Freital, Pirna, Radebeul, Coswig and Heidenau and has around 790,000 inhabitants.[2] The Dresden metropolitan area has approximately 1.34 million inhabitants.[1]<br><br>Dresden is the second largest city on the River Elbe after Hamburg.[a] Most of the city's population lives in the Elbe Valley, but a large, albeit very sparsely populated area of the city east of the Elbe lies in the West Lusatian Hill Country and Uplands (the westernmost part of the Sudetes) and thus in Lusatia, while many boroughs west of the Elbe lie in the foreland of the Ore Mountains as well as in the valleys of the rivers rising there and flowing through Dresden, the longest of which are the Weißeritz and the Lockwitzbach. The name of the city as well as the names of most of its boroughs and rivers are of Slavic origin.<br><br>Dresden has a long history as the capital and royal residence for the Electors and Kings of Saxony, who for centuries furnished the city with cultural and artistic splendor, and was once by personal union the family seat of Polish monarchs. The city was known as the Jewel Box, because of its baroque and rococo city centre. The controversial American and British bombing of Dresden in World War II towards the end of the war killed approximately 25,000 people, many of whom were civilians, and destroyed the entire city centre. After the war, restoration work has helped to reconstruct parts of the historic inner city.<br><br>Since German reunification in 1990, Dresden has again become a cultural, educational and political centre of Germany. The Dresden University of Technology is one of the 10 largest universities in Germany and part of the German Universities Excellence Initiative. The economy of Dresden and its agglomeration is one of the most dynamic in Germany and ranks first in Saxony.[4] It is dominated by high-tech branches, often called \"Silicon Saxony\". According to the Hamburg Institute of International Economics (HWWI) and Berenberg Bank, in 2019, Dresden had the seventh best prospects for the future of all cities in Germany.[5]<br><br>Dresden is one of the most visited cities in Germany with 4.7 million overnight stays per year.[6][7] Its most prominent building is the Frauenkirche located at the Neumarkt. Built in the 18th century, the church was destroyed during World War II. The remaining ruins were left for 50 years as a war memorial, before being rebuilt between 1994 and 2005. Other famous landmarks include the Zwinger, the Semperoper and the Dresden Castle. Furthermore, the city is home to the renowned Dresden State Art Collections, originating from the collections of the Saxon electors in the 16th century. Dresden's Striezelmarkt is one of the largest Christmas markets in Germany and is considered the first genuine Christmas market in the world.[8] Nearby sights include the National Park of Saxon Switzerland, the Ore Mountains and the countryside around Elbe Valley and Moritzburg Castle.", "dres.jpg", "Capital of Saxony"],
    ["CMAGDEBURG", "Magdeburg", "Magdeburg (German: [ˈmakdəbʊʁk] (About this soundlisten); Low Saxon: Meideborg [ˈmaˑɪdebɔɐ̯x]) is the capital and second-largest city of the German state of Saxony-Anhalt, after Halle (Saale). It is situated on the Elbe River.[2]<br><br>Otto I, the first Holy Roman Emperor and founder of the archbishopric of Magdeburg, was buried in the city's cathedral after his death.[2] Magdeburg's version of German town law, known as Magdeburg rights, spread throughout Central and Eastern Europe. Until 1631, Magdeburg was one of the largest and most prosperous German cities and a notable member of the Hanseatic League.<br><br>Magdeburg has been destroyed twice in its history. The Catholic League sacked Magdeburg in 1631,[2] resulting in the death of 25,000 non-combatants, the largest loss of the Thirty Years' War. Allies bombed the city in 1945, destroying much of it.<br><br>Magdeburg is the site of two universities, the Otto-von-Guericke University and the Magdeburg-Stendal University of Applied Sciences.[3]<br><br>Magdeburg is situated on autobahn route 2, and hence is at the connection point of the East (Berlin and beyond) with the West of Europe, as well as the North and South of Germany. As a modern manufacturing centre, the production of chemical products, steel, paper, and textiles are of particular economic significance, along with mechanical engineering and plant engineering, ecotechnology and life-cycle management, health management and logistics.<br><br>In 2005 Magdeburg celebrated its 1200th anniversary. In June 2013 the city was hit by record breaking flooding.", "mag.jpg", "Capital of Saxony-Anhalt"],
    ["CKIEL", "Kiel", "Kiel (German: [kiːl] (About this soundlisten)) is the capital and most populous city in the northern German state of Schleswig-Holstein, with a population of 249,023 (2016).<br><br>Kiel lies approximately 90 kilometres (56 mi) north of Hamburg. Due to its geographic location in the southeast of the Jutland peninsula on the southwestern shore of the Baltic Sea, Kiel has become one of Germany's major maritime centres, known for a variety of international sailing events, including the annual Kiel Week, which is the biggest sailing event in the world. Kiel is also known for the Kiel Mutiny, when sailors refused to board their vessels in protest against Germany's further participation in World War I, resulting in the abdication of the Kaiser and the formation of the Weimar Republic. The Olympic sailing competitions of the 1936 and the 1972 Summer Olympics were held in the Bay of Kiel.[4]<br><br>Kiel has also been one of the traditional homes of the German Navy's Baltic fleet, and continues to be a major high-tech shipbuilding centre. Located in Kiel is the GEOMAR - Helmholtz Centre for Ocean Research Kiel at the University of Kiel. Kiel is an important sea transport hub, thanks to its location on the Kiel Fjord (Kieler Förde) and the busiest artificial waterway in the world,[5] Kiel Canal (Nord-Ostsee-Kanal). A number of passenger ferries to Sweden, Norway, Lithuania and other countries operate from here. Moreover, today Port of Kiel is a popular desination for cruise ships touring the Baltic Sea.<br><br>Kiel's recorded history began in the 13th century. Before then, in the eighth century, it was a Danish village. Until 1864 it was administered by Denmark in personal union. In 1866 the city was annexed by Prussia and in 1871 it became part of Germany.<br><br>Kiel was one of the founding cities of the original European Green Capital Award in 2006.[6] In 2005 Kiel's GDP per capita was €35,618, which is well above Germany's national average, and 159% of the European Union's average.", "kiel.jpg", "Capital of Schleswig-Holstein"],
    ["CERFURT", "Erfurt", "Erfurt (/ˈɛərfɜːrt/ AIR-furt, /ˈɛərfʊərt/ AIR-foort;[2][3] German pronunciation: [ˈɛʁfʊʁt] (About this soundlisten))[4] is the capital and largest city in the state of Thuringia, central Germany. It is located in the southern part of the Thuringian Basin, within the wide valley of the Gera river. It is located 100 km (62 mi) south-west of Leipzig, 300 km (186 mi) south-west of Berlin, 400 km (249 mi) north of Munich and 250 km (155 mi) north-east of Frankfurt. Together with a string of neighbouring cities Gotha, Weimar, Jena and others, Erfurt forms the central metropolitan corridor of Thuringia called Thüringer Städtekette (German \"Thuringian city chain\") with over 500,000 inhabitants.<br><br>Erfurt's old town is one of the best preserved medieval city centres in Germany.[5] Tourist attractions include the Krämerbrücke (Merchants' bridge), the Old Synagogue, the ensemble of Erfurt Cathedral and Severikirche (St Severus's Church) and Petersberg Citadel, one of the largest and best preserved town fortresses in Europe.[6] The city's economy is based on agriculture, horticulture and microelectronics. Its central location has led to it becoming a logistics hub for Germany and central Europe. Erfurt hosts the second-largest trade fair in eastern Germany (after Leipzig) as well as the public television children's channel KiKa.<br><br>The city is situated on the Via Regia, a medieval trade and pilgrims' road network. Modern day Erfurt is also a hub for ICE high speed trains and other German and European transport networks. Erfurt was first mentioned in 742, as Saint Boniface founded the diocese. Although the town did not belong to any of the Thuringian states politically, it quickly became the economic centre of the region and it was a member of the Hanseatic League.[7] It was part of the Electorate of Mainz during the Holy Roman Empire, and later became part of the Kingdom of Prussia in 1802. From 1949 until 1990 Erfurt was part of the German Democratic Republic (East Germany).<br><br>The University of Erfurt was founded in 1379,[8] making it the first university to be established within the geographic area which constitutes modern-day Germany. It closed in 1816 and was re-established in 1994, with the main modern campus on what was a teachers' training college. Martin Luther (1483–1546) was its most famous student, studying there from 1501 before entering St Augustine's Monastery in 1505.[9] Other noted Erfurters include the medieval philosopher and mystic Meister Eckhart (c. 1260–1328), the Baroque composer Johann Pachelbel (1653–1706) and the sociologist Max Weber (1864–1920).", "erfurt.jpg", "Capital of Thuringia"]
]